CFD_OF2/Section3_MeshRefine/MeshA_Refine/MeshA_R4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       25875;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       25995;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       26115;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          105;
        startFace       26315;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          105;
        startFace       26420;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          26200;
        startFace       26525;
    }
)

// ************************************************************************* //
